<?php
// config/pdf.php

return [

    /*
    |--------------------------------------------------------------------------
    | تنظیمات عمومی PDF
    |--------------------------------------------------------------------------
    */
    'mode' => 'utf-8',
    'format' => 'A4',
    'author' => 'Pega HR System',
    'subject' => '',
    'keywords' => '',
    'creator' => 'Laravel mPDF',
    'display_mode' => 'fullpage',

    /*
    |--------------------------------------------------------------------------
    | تنظیمات زبان و راست‌به‌چپ
    |--------------------------------------------------------------------------
    */
    'direction' => 'rtl',
    'autoScriptToLang' => true,
    'autoLangToFont' => true,
    'useOTL' => 0xFF, // مهم برای حروف‌چینی فارسی
    'useKashida' => 0,

    /*
    |--------------------------------------------------------------------------
    | مسیر فایل‌های موقت
    |--------------------------------------------------------------------------
    */
    'temp_dir' => storage_path('app/pdf-temp'),
    'pdf_a' => false,

    /*
    |--------------------------------------------------------------------------
    | تعریف فونت‌ها
    |--------------------------------------------------------------------------
    */
    'fonts' => [
        'vazirmatn' => [
            'R' => public_path('assets/fonts/Vazirmatn-Regular.ttf'), // مسیر صحیح
            'B' => public_path('assets/fonts/Vazirmatn-Bold.ttf'),    // مسیر صحیح
            'useOTL' => 0xFF,
            'useKashida' => 0,
        ],
    ],

    /*
    |--------------------------------------------------------------------------
    | فونت پیش‌فرض
    |--------------------------------------------------------------------------
    */
    'default_font' => 'vazirmatn', // فونت vazirmatn به عنوان فونت پیش‌فرض تنظیم شده است.

];